In [3]:
import pandas as pd

In [4]:
import numpy as np

### 11.Create a Series of 5 numbers and assign custom labels.

In [5]:
labels = ['a','b','c','d','e' ]
s = pd.Series([1,2,3,4,5 ] , index = labels)

In [6]:
s

a    1
b    2
c    3
d    4
e    5
dtype: int64

###  12. Construct a DataFrame from a dictionary with student names, marks, and cities

In [7]:
data = {
    'name' : ['puja' ,'vaishnavi','shravani','aaditi' ],
    'marks' :[50,80,50,80],
    'city' : ['pune','pune','pune','pune'],
}
df = pd.DataFrame(data)

In [8]:
df

        name  marks  city
0       puja     50  pune
1  vaishnavi     80  pune
2   shravani     50  pune
3     aaditi     80  pune

### 13. Create a DataFrame from a NumPy array and assign column names

In [9]:
data = np.array ([
    [101 ,'puja','pune'],
    [102,'vaishnavi','pune']
])
df1 = pd.DataFrame(data , columns = [ 'roll','name','city'])

In [10]:
df1

  roll       name  city
0  101       puja  pune
1  102  vaishnavi  pune

### 14. Use loc and iloc to select specific rows and columns from a DataFrame.

In [11]:
df.iloc[[0,1,3],0:2]

        name  marks
0       puja     50
1  vaishnavi     80
3     aaditi     80

In [12]:
df.loc[:,'name']

0         puja
1    vaishnavi
2     shravani
3       aaditi
Name: name, dtype: object

### 15. Apply head(), tail(), shape, info(), and describe() to explore a DataFrame

In [13]:
df2 = pd.read_csv("student.csv")

In [14]:
df2

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [15]:
df2.head()

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20

In [16]:
df2.tail()

   roll    name class  marks  age
5     6  ayesha    BE  49.55   20
6     7    amar    BE  65.34   19
7     8   amita    BE  68.33   23
8     9    amol    TE  56.75   20
9    10   anmol    BE  78.66   21

In [17]:
df2.shape

(10, 5)

In [18]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   roll    10 non-null     int64
 1   name    10 non-null     object
 2   class   10 non-null     object
 3   marks   10 non-null     float64
 4   age     10 non-null     int64
dtypes: float64(1), int64(2), object(2)
memory usage: 532.0+ bytes

In [19]:
df2.describe()

           roll      marks        age
count  10.00000  10.000000  10.000000
mean    5.50000  64.499000  20.500000
std     3.02765   9.207179   1.269296
min     1.00000  49.550000  19.000000
25%     3.25000  57.520000  20.000000
50%     5.50000  64.310000  20.000000
75%     7.75000  69.327500  21.000000
max    10.00000  78.660000  23.000000

### 16. Sort a DataFrame by values in a column using sort_values()

In [20]:
df2.sort_values(by = "age")

   roll     name class  marks  age
2     3   aniket    BE  76.88   19
6     7     amar    BE  65.34   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
8     9     amol    TE  56.75   20
1     2     amit    TE  59.77   21
9    10    anmol    BE  78.66   21
0     1     anil    TE  56.77   22
7     8    amita    BE  68.33   23

### 17. Sort a DataFrame based on the index using sort_index().

In [21]:
df2.sort_index(ascending = False)

   roll     name class  marks  age
9    10    anmol    BE  78.66   21
8     9     amol    TE  56.75   20
7     8    amita    BE  68.33   23
6     7     amar    BE  65.34   19
5     6   ayesha    BE  49.55   20
4     5     asha    TE  63.28   20
3     4  ajinkya    TE  69.66   20
2     3   aniket    BE  76.88   19
1     2     amit    TE  59.77   21
0     1     anil    TE  56.77   22

### 18. Filter rows in a DataFrame where a column (e.g., marks) is greater than a threshold

In [22]:
df2[df2['marks'] > 60]

   roll     name class  marks  age
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
9    10    anmol    BE  78.66   21

### 19. Group a DataFrame by a column (e.g., city) and calculate the average marks

In [23]:
df

        name  marks  city
0       puja     50  pune
1  vaishnavi     80  pune
2   shravani     50  pune
3     aaditi     80  pune

In [26]:
df.groupby('city')['marks'].mean()

city
pune    65.0
Name: marks, dtype: float64

###  20. Use agg() to apply multiple aggregation functions (mean, min, max) on a grouped DataFrame

In [28]:
gr = df2.groupby('class')

In [29]:
gr.groups

{'BE': [2, 5, 6, 7, 9], 'TE': [0, 1, 3, 4, 8]}

In [31]:
gr.get_group('BE')

   roll    name class  marks  age
2     3  aniket    BE  76.88   19
5     6  ayesha    BE  49.55   20
6     7    amar    BE  65.34   19
7     8   amita    BE  68.33   23
9    10   anmol    BE  78.66   21

In [32]:
gr['marks'].mean()

class
BE    67.752
TE    61.246
Name: marks, dtype: float64

In [33]:
gr['marks'].min()

class
BE    49.55
TE    56.75
Name: marks, dtype: float64

In [34]:
gr['marks'].max()

class
BE    78.66
TE    69.66
Name: marks, dtype: float64

###  21. Merge two DataFrames on a common column (e.g., student ID).

In [45]:
data1 = pd.DataFrame({
    'student_id': [1, 2, 3],
    'name': ['puja', 'shravani', 'aarya']
})

data2 = pd.DataFrame({
    'student_id': [1, 2, 3],
    'city': ['Pune', 'Mumbai', 'Pune']
})
pd.merge(data1, data2, on='student_id')

   student_id      name    city
0           1      puja    Pune
1           2  shravani  Mumbai
2           3     aarya    Pune

###  22. Concatenate two DataFrames vertically and reset the index

In [46]:
df3 = pd.read_csv("student5.csv")

In [47]:
df3

   roll     name class  marks  age
0     1   surbhi    TE  67.44   23
1     2    sujay    TE  74.12   22
2     3  subhash    BE  82.44   21
3     4   sachin    TE  59.33   21
4     5  shalini    TE  63.45   20

In [48]:
df

        name  marks  city
0       puja     50  pune
1  vaishnavi     80  pune
2   shravani     50  pune
3     aaditi     80  pune

In [49]:
pd.concat([df3,df] , ignore_index = True)

   roll       name class  marks   age  city
0   1.0     surbhi    TE  67.44  23.0   NaN
1   2.0      sujay    TE  74.12  22.0   NaN
2   3.0    subhash    BE  82.44  21.0   NaN
3   4.0     sachin    TE  59.33  21.0   NaN
4   5.0    shalini    TE  63.45  20.0   NaN
5   NaN       puja   NaN  50.00   NaN  pune
6   NaN  vaishnavi   NaN  80.00   NaN  pune
7   NaN   shravani   NaN  50.00   NaN  pune
8   NaN     aaditi   NaN  80.00   NaN  pune